// ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে। 



// তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে।

let friendsAge = ['11', '12', '13', '14', '15', '16'];   // একটা array ডিক্লেয়ার করবে।

// console.log(friendsAge.length);    // কয়টা উপাদান আছে সেটা বের করবে হবে।



// array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে।

let friendAge = ['11', '12', '13', '14', '15', '16'];

friendAge[4] = '22';
// console.log(friendAge);


// array এর মধ্যে দুইটা উপাদান যোগ করতে হবে।

// push

let friendssAge = ['11', '12', '13', '14', '15', '16'];

// friendssAge.push('17', '18');
// console.log(friendssAge);

// pop


friendssAge.pop();
console.log(friendssAge);

friendssAge.pop();
console.log(friendssAge);